[
{"term":"Plate tectonics","def":"The theory that the outer layer of the Earth (the lithosphere) is broken in several plates, and these plates move relative to one another, causing the major topographic features of Earth (e.g. mountains, oceans) and most earthquakes and volcanoes."},
{"term":"plate","def":"A solid part of the lithosphere which moves as a unit, i.e. the entire plate generally moves the same direction at the same speed."},
{"term":"fault","def":"Planer feature where two blocks of bedrock move past each other via earthquakes."},
{"term":"abyssal plain","def":"Relatively flat ocean floor, which accumulates very fine grained detrital and chemical sediments."},
{"term":"basin","def":"A down-warped feature in the crust."},
{"term":"sediments","def":"Pieces of rock that have be weathered and possibly eroded."},
{"term":"epicenter","def":"The location at the surface directly above the focus of an earthquake, typically associated with strong damage."},
{"term":"mid-ocean ridge (spreading centers)","def":"A divergent boundary within an oceanic plate, where new lithosphere and crust is created as the two plates spread apart. Mid-ocean ridge and spreading center are synonyms."},
{"term":"anomaly","def":"Data which is out of the ordinary and does not fit previous trends."},
{"term":"Paleomagnetism","def":"As a rock cools, the iron minerals within the rock align with the current magnetic field. Since the magnetic field changes (by where you are on Earth, by flips where \"north\"and \"south\" switch, and by migration of the magnetic north pole), scientists use the magnetic alignment within rocks to determine past movement or the magnetic field itself, along with the movement of rocks and plates via plate tectonics."},
{"term":"igneous rock","def":"Rocks that are formed from liquid rock, i.e. from volcanic processes."},
{"term":"mineral","def":"A natural substance that is typically solid, has a crystalline structure, and is typically formed by inorganic processes. Minerals are the building blocks of most rocks."},
{"term":"magma","def":"Liquid rock within the Earth."},
{"term":"lava","def":"Liquid rock on the surface of the Earth."},
{"term":"continental crust","def":"The layers of igneous, sedimentary, and metamorphic rocks that form the continents. Continental crust is much thicker than oceanic crust. Continental crust is defined as having higher concentrations of very light elements like K, Na, and Ca, and is the lowest density rocky layer of Earth. Its average composition is similar to granite."},
{"term":"mantle","def":"Middle chemical layer of the Earth, made of mainly iron and magnesium silicates. It is generally denser than the crust (except for older oceanic crust) and less dense than the core."},
{"term":"Wadati-Benioff zones","def":"Earthquake zones further inland where recorded epicenters are found that trace the shape of oceanic plates sinking into the mantle."},
{"term":"meteorite","def":"A stoney and/or metallic object from our solar system which was never incorporated into a planet and has fallen onto Earth. Meteorite is used for the rock on Earth, meteoroid for the object in space, and meteor as the object travels in Earth's atmosphere."},
{"term":"seismic wave","def":"Energy that radiates from fault movement via earthquakes."},
{"term":"composition","def":"The mineral make up of a rock, i.e. which minerals are found within a rock."},
{"term":"element","def":"A group of all atoms with a specific number of protons, having specific, universal, and unique properties."},
{"term":"Temperature","def":"The measure of the vibrational (kinetic) energy of a substance."},
{"term":"crust","def":"The outermost chemical layer of the Earth, defined by its low density and higher concentrations of lighter elements. The crust has two types: continental, which is the thick, more ductile, and lowest density, and oceanic, which is higher density, more brittle, and thinner."},
{"term":"granite","def":"General name of a felsic rock that is intrusive. Has more felsic minerals than mafic minerals."},
{"term":"brittle","def":"A property of solids in which a force applied to an object causes the object to fracture, break, or snap. Most rocks, at low temperatures, are brittle."},
{"term":"ductile","def":"A property of a solid, such that when a force is applied, the solid flows, stretches, or bends along with the force, instead of cracking or breaking. For example, many plastics are ductile."},
{"term":"moho","def":"Short for Mohorovičić Discontinuity, it is the seismically-recognized layer within the Earth in which the crust ends and the mantle begins. Because the crust is very different in composition to the mantle, the moho is easy to find, since seismic waves travel differently through the two materials."},
{"term":"core","def":"The innermost chemical layer of the Earth, made chiefly of iron and nickel. It has both liquid and solid components."},
{"term":"ophiolite","def":"Rocks of the ocean floor, such as mid-ocean ridge rocks, which are brought to the surface."},
{"term":"xenolith","def":"A piece of foreign rock that has been incorporated into a magma body. This can be a different type of magma, or a mantle xenolith, a rock from the mantle brought up near the surface."},
{"term":"peridotite","def":"An intrusive ultramafic rock, which is the main component of the mantle. The minerals in peridotite are typically olivine with some pyroxene."},
{"term":"ultramafic","def":"An igneous rock with extremely low silica composition, being made of almost all olivine and pyroxene. Ultramafic rocks contain very low amount of silica and are common in the mantle. Primary ultramafic rocks are komatiite (extrusive) and peridotite (intrusive)."},
{"term":"metallic","def":"Minerals with a luster similar to metal and contain metals, including valuable elements like lead, zinc, copper, tin, etc."},
{"term":"stress","def":"Force applied to an object, typically dealing with forces within the Earth."},
{"term":"lithosphere","def":"The outermost physical layer of the Earth, made of the entire crust and upper mantle. It is brittle and broken into a series of plates, and these plates move in various ways (relative to one another), causing the features of the theory of plate tectonics."},
{"term":"plate boundary","def":"Location where two plates are in contact, allowing a relative motion between the two plates. These are the locations where most earthquakes and volcanoes are found."},
{"term":"asthenosphere","def":"A ductile physical layer of the Earth, below the lithosphere. Movement within the asthenosphere is the main driver of plate motion, as the overriding lithosphere is pushed by this."},
{"term":"convection","def":"The property of unevenly-heated (heated from one direction) fluids (like water, air, ductile solids) in which warmer, less dense parts within the fluid rise while cooler, denser parts sink. This typically creates convection cells: round loops of rising and sinking material."},
{"term":"outer core","def":"The outer physical layer of the core, which is liquid. Movement within the outer core is believed to be responsible for Earth's magnetic field and flips of the magnetic field. 2,300 km"},
{"term":"inner core","def":"The innermost physical layer of the Earth, which is solid. 1,220 km"},
{"term":"passive margin","def":"A boundary between continental and oceanic plates that has no relative movement, making it a place where an oceanic plate is connected to a continental plate, but it is not a plate boundary."},
{"term":"oceanic crust","def":"The thin, outer layer of the Earth which makes up the rocky bottom of the ocean basins. It is made of rocks similar to basalt, and as it cools, even become more dense than the upper mantle below."},
{"term":"Convergent (destructive boundaries)","def":"Place where two plates come together, casing subduction or collision."},
{"term":"divergent","def":"Place where two plates are moving apart, creating either a rift (continental lithosphere) or a mid-ocean ridge (oceanic lithosphere)."},
{"term":"transform","def":"Place where two plates slide past each other, creating strike slip faults."},
{"term":"subduction","def":"A process where an oceanic plate descends bellow a less dense plate, causing the removal of the plate from the surface. Subduction causes the largest earthquakes possible, as the subducting plate can lock as it goes down. Volcanism is also caused as the plate releases volatiles into the mantle, causing melting."},
{"term":"convergent","def":"Place where two plates come together, casing subduction or collision."},
{"term":"collision","def":"When two continents crash, with no subduction (and thus little to no volcanism), since each continent is to buoyant. Many of the largest mountain ranges and broadest zones of seismic activity come from collisions."},
{"term":"trench","def":"Deepest part of the ocean where a subducting plate dives below the overriding plate."},
{"term":"terrane","def":"A geological province which is added (accreted) to a continental mass via subduction and collision."},
{"term":"slab","def":"Name given to the subducting plate, where volatiles are driven out at depth, causing volcanism."},
{"term":"mantle wedge","def":"The area of the mantle where volatiles rise from the slab, causing flux melting and volcanism."},
{"term":"hypothesis","def":"A proposed explanation for an observation that can be tested."},
{"term":"coastline","def":"The entire area which is related to land-sea interactions."},
{"term":"tsunami","def":"Formally known as a tidal wave, it is a large wave produced from a sudden movement of the floor of a ocean basin, caused by events such as earthquakes, volcanic eruptions, landslides, and bolide impacts."},
{"term":"magnitude","def":"A measure of earthquake strength. Scales include Richter and Moment."},
{"term":"massive","def":"A feature with no internal structure, habit, or layering."},
{"term":"volcanic arc","def":"Place with a chain of mountain volcanism on a continent, from oceanic-continental subduction."},
{"term":"deformation","def":"A strain that occurs in a substance in which the item changes shape due to a stress."},
{"term":"accretionary wedge","def":"Mix of sediments that form as a subducting plate descends and the overriding plate scrapes material and material is added."},
{"term":"tension","def":"Stresses that pull objects apart into a larger surface area or volume; stretching forces."},
{"term":"rift","def":"Area of extended continental lithosphere, forming a depression. Rifts can be narrow (focused in one place) or broad (spread out over a large area with many faults)."},
{"term":"back-arc","def":"Area behind the arc, which can be subject to compressional (causing thrusted mountain belts) or extensional (causing back-arc basins) forces."},
{"term":"compression","def":"Stresses that push objects together into a smaller surface area or volume; contracting forces."},
{"term":"thrust fault","def":"A low-angle reverse fault, common in mountain building."},
{"term":"thick-skinned","def":"Faulting that is deep into the crust, and typically involves crystalline basement rocks."},
{"term":"orogeny","def":"The process of uplifting mountain within mountain belts, primarily via tectonic movement. Orogenic belts are the mountain belts that result from these movements, and orogenesis is the name for the process of forming mountain belts."},
{"term":"thin-skinned","def":"Faulting that is not deep into the crust, and typically only involves sedimentary cover, not basement rocks."},
{"term":"Cretaceous","def":"The last period of the Mesozoic, 145-66 million years ago."},
{"term":"period","def":"The third largest span of time recognized by geologists; smaller than a era, larger than a epoch. We are currently in the Quaternary period. Rocks of a specific period are called systems."},
{"term":"oceanic-continental subduction","def":"Where an ocean plate subducts beneath a continental plate, causing a volcanic arc to form."},
{"term":"oceanic-oceanic subduction","def":"Where a dense ocean plate subducts beneath a less dense oceanic plate, causing an island arc to form."},
{"term":"island arc","def":"Place where oceanic-oceanic subduction causes volcanoes to form on an overriding oceanic plate, making a chain of active volcanoes."},
{"term":"formation","def":"An extensive, distinct, and mapped set of geologic layers."},
{"term":"supercontinent","def":"An arrangement of many continental masses collided together into one larger mass. According to the Wilson Cycle, this occurs every half billion years or so."},
{"term":"Pangea","def":"The most recent supercontinent, which formed over 300 million years ago and started breaking apart less than 200 million years ago. Africa and South America, as well as Europe and North America, bordered each other."},
{"term":"Rodinia","def":"The supercontinent that existed before Pangea, about 1 billion years ago. North America was positioned in the center of the land mass."},
{"term":"obduction","def":"Process which allows a continental plate to bring up oceanic plate, frequently occurring in collision zones."},
{"term":"graben","def":"A valley formed by normal faulting."},
{"term":"horst","def":"Uplifted mountain block caused by normal faulting."},
{"term":"half graben","def":"A valley formed by normal faulting on just one side."},
{"term":"craton","def":"The stable interior part of a continent, typically more than a billion years old, and sometimes as old as  2.5-3 billion years. When exposed on the surface, a craton is called a shield."},
{"term":"fracture","def":"A break within a rock that has no relative movement between the sides. Caused by cooling, pressure release, tectonic forces, etc."},
{"term":"failed rift arm","def":"A section of a rift that starts but does not complete. This typically occurs at 120° angles to the active rift."},
{"term":"aulacogen","def":"A depression that occurs in an area that was subject to earlier rifting."},
{"term":"triple junction","def":"Place where three plate boundaries (typically divergent) extend from a single point at 120° angles."},
{"term":"horn","def":"Steep spire carved by several glaciers."},
{"term":"basin and range","def":"Term for the extensional tectonic province that extends from California's Sierra Nevada Mountains in the west, to Utah's Wasatch Mountains to the east, to southern Oregon and Idaho to the north, to northern Mexico to the south. Known as a wide rift, as each graben 'basin,' bounded by horst 'ranges.' Each set of horsts with a graben has some individual extension, adding up to the overall rifting."},
{"term":"Decompression melting","def":"Melting that occurs as material is moved upward and pressure is released, typically found at divergent plate boundaries or hot spots."},
{"term":"carbonate","def":"Mineral group in which the carbonate ion, CO3-2, is the building block. This can also refer to the rocks that are made from these minerals, namely limestone and dolomite (dolostone)."},
{"term":"mafic","def":"Can refer to a volcanic rock with lower silica composition, or the minerals that make up those rocks, namely olivine, pyroxene, amphibole, and biotite. Mafic rocks are darker in color and contain more minerals that are dark in color, but can contain some plagioclase feldspar. Primary mafic rocks are basalt (extrusive) and gabbro (intrusive)."},
{"term":"theory","def":"An accepted scientific idea that explains a process using the best available information."},
{"term":"hydrothermal","def":"Metamorphism which occurs with hot fluids going within rocks, altering and changing the rocks."},
{"term":"dissolution","def":"The process in which solids (like minerals) are disassociated and the ionic components are dispersed in a liquid (usually water)."},
{"term":"chemosynthesis","def":"A biologic process of gaining energy from chemicals from within the Earth, similar to using the energy of the sun in photosynthesis."},
{"term":"strike slip","def":"Faulting that occurs with shear forces, typically on vertical fault plaines as two fault blocks slide past each other."},
{"term":"Dextral (right-lateral)","def":"Movement in a transform or strike-slip setting which it toward the right across the fault. As viewed across the fault, objects will move to the right."},
{"term":"Sinistral (left lateral)","def":"A strike-slip or transform motion in which the relative motion is to the left. As viewed across the fault, objects will move to the left."},
{"term":"aseismic","def":"Fault, or movement along a fault, that does not have earthquake activity."},
{"term":"shear","def":"Stress within an object that causes a side-to-side movement within an internal fabric or weakness."},
{"term":"transpression","def":"A segment along a transform or strike-slip fault which has a compressional component, sometimes creating related thrust faulting and mountains."},
{"term":"piercing point","def":"An object that is cut by a fault which allows the amount of movement to be determined. This is useful for all faults, but more commonly used in strike-slip faults."},
{"term":"system","def":"An interconnected set of parts that combine and make up a whole."},
{"term":"Wilson Cycle","def":"The cycle of opening ocean basins with rifting and seafloor spreading, then closing the basin via subduction and collision, creating a supercontinent."},
{"term":"Ridge-push","def":"The ridge-push hypothesis suggests after the initial rifting event, plates continue to be pushed apart by mid-ocean spreading centers and their underlying convection currents."},
{"term":"Slab-pull","def":"Slab-pull proposes the plates are pulled apart by descending slabs in the subduction zones of the oceanic-continental margins."},
{"term":"Gravitational sliding","def":"A third idea, gravitational sliding, attributes the movement to gravitational forces pulling the lithospheric plates down from the elevated mid-ocean ridges and across the underlying asthenosphere."},
{"term":"hot spot","def":"Rising stationary magma, forming a succession of volcanism. This is reflected as islands on oceanic plates, and volcanic mountains or craters on land."},
{"term":"mantle plume","def":"Rising material and heat derived from the mantle. These may be responsible for hot spots."},
{"term":"vent","def":"Opening of a volcano where lava can erupt."},
{"term":"seamount","def":"An eroded island. Since wave and weather action does not extend deep into the ocean, the root of the island is preserved as a seamount. Reefs can grow around seamounts."},
{"term":"tomography","def":"A process of using 3D seismic arrays to get subsurface images."},
{"term":"flood basalt","def":"Rare very low viscosity eruption that covers vast areas. None have been observed in human history."},
{"term":"caldera","def":"Hole left behind after a large volume of material erupts out of a volcano. This depression is often tuned into a valley or lake after the eruption is over."},
{"term":"tuff","def":"Rocks made from pyroclastic tephra: either ash, lapilli, and/or bombs. Tephra type can be used as an adjective, i.e. ash-fall tuff. If deposited hot, where material can fuse together while hot, the rock is then called a welded tuff."},
{"term":"ash","def":"Volcanic tephra that is less than 2 mm in diameter."}
]